## **Latihan Pandas 1**

## Jangan di-run! Copy dulu file ini, kemudian jawab di file copy tersebut

**Membuat DataFrame**

Ikuti semua petunjuk yang harus dilakukan di bawah ini.

**Step 1. Import library yang dibutuhkan.**

In [33]:
import numpy as np 
import pandas as pd

**Step 2. Buat dictionary untuk membuat DataFrame berjumlah 5 key dan masing-masing key memiliki value berupa list dengan 10 item.**

In [34]:
nama = 'Adele, Beyonce, Camila, Donald, Eminem, Ferguson, Gaga, Hillary, Indro, Joko'.split(', ')
umur = [24, 25, 30, 32, 28, 24, 29, 31, 30, 29]
gender = 'Wanita, Wanita, Wanita, Pria, Pria, Pria, Wanita, Wanita, Pria, Pria'.split(', ')
pekerjaan = 'Data Analyst, Data Engineer, Data Scientist, Data Scientist, Data Analyst, Data Engineer, ML Engineer, ML Researcher, BI Analyst, Data Analyst'.split(', ')
domisili = 'Jakarta, Tangerang, Jakarta, Bandung, Jakarta, Surabaya, Bandung, Yogyakarta, Jakarta, Tangerang'.split(', ')

df = pd.DataFrame({
    'Nama' : nama,
    'Umur' : umur,
    'Gender' : gender,
    'Pekerjaan' : pekerjaan,
    'Domisili' : domisili
})
df

       Nama  Umur  Gender       Pekerjaan    Domisili
0     Adele    24  Wanita    Data Analyst     Jakarta
1   Beyonce    25  Wanita   Data Engineer   Tangerang
2    Camila    30  Wanita  Data Scientist     Jakarta
3    Donald    32    Pria  Data Scientist     Bandung
4    Eminem    28    Pria    Data Analyst     Jakarta
5  Ferguson    24    Pria   Data Engineer    Surabaya
6      Gaga    29  Wanita     ML Engineer     Bandung
7   Hillary    31  Wanita   ML Researcher  Yogyakarta
8     Indro    30    Pria      BI Analyst     Jakarta
9      Joko    29    Pria    Data Analyst   Tangerang

**Step 3. Ubah urutan kolom tersebut menjadi seperti berikut: Nama, Gender, Umur, Domisili, Pekerjaan.**

In [35]:
df[['Nama','Gender','Umur','Domisili','Pekerjaan']]

       Nama  Gender  Umur    Domisili       Pekerjaan
0     Adele  Wanita    24     Jakarta    Data Analyst
1   Beyonce  Wanita    25   Tangerang   Data Engineer
2    Camila  Wanita    30     Jakarta  Data Scientist
3    Donald    Pria    32     Bandung  Data Scientist
4    Eminem    Pria    28     Jakarta    Data Analyst
5  Ferguson    Pria    24    Surabaya   Data Engineer
6      Gaga  Wanita    29     Bandung     ML Engineer
7   Hillary  Wanita    31  Yogyakarta   ML Researcher
8     Indro    Pria    30     Jakarta      BI Analyst
9      Joko    Pria    29   Tangerang    Data Analyst

**Step 4. Tambahkan 1 kolom baru bernama 'Hobi' dan isikan datanya seperti output berikut.**

In [36]:
hobi = 'Gaming, Masak, Baca, Gaming, Futsal, Traveling, Basket, Traveling, Gaming, Futsal'.split(', ')
df['Hobi'] = hobi
df

       Nama  Umur  Gender       Pekerjaan    Domisili       Hobi
0     Adele    24  Wanita    Data Analyst     Jakarta     Gaming
1   Beyonce    25  Wanita   Data Engineer   Tangerang      Masak
2    Camila    30  Wanita  Data Scientist     Jakarta       Baca
3    Donald    32    Pria  Data Scientist     Bandung     Gaming
4    Eminem    28    Pria    Data Analyst     Jakarta     Futsal
5  Ferguson    24    Pria   Data Engineer    Surabaya  Traveling
6      Gaga    29  Wanita     ML Engineer     Bandung     Basket
7   Hillary    31  Wanita   ML Researcher  Yogyakarta  Traveling
8     Indro    30    Pria      BI Analyst     Jakarta     Gaming
9      Joko    29    Pria    Data Analyst   Tangerang     Futsal

**Soal Lanjutan**

**5. Gunakan .iloc untuk mengambil data Donald, Ferguson, Hillary**

In [37]:
df.iloc[3:8:2]

       Nama  Umur  Gender       Pekerjaan    Domisili       Hobi
3    Donald    32    Pria  Data Scientist     Bandung     Gaming
5  Ferguson    24    Pria   Data Engineer    Surabaya  Traveling
7   Hillary    31  Wanita   ML Researcher  Yogyakarta  Traveling

**6. Gunakan .loc untuk menampilkan domisili dan pekerjaan dari Camila dan Indro (termasuk kolom nama)**

In [38]:
df.loc[2:9:6,['Nama', 'Domisili', 'Pekerjaan']]

     Nama Domisili       Pekerjaan
2  Camila  Jakarta  Data Scientist
8   Indro  Jakarta      BI Analyst

**7. Gunakan .iloc untuk menampilkan semua data dari Hillary dan Joko**

In [39]:
df.iloc[7:10:2]

      Nama  Umur  Gender      Pekerjaan    Domisili       Hobi
7  Hillary    31  Wanita  ML Researcher  Yogyakarta  Traveling
9     Joko    29    Pria   Data Analyst   Tangerang     Futsal

**8. Siapa sajakah yang berumur lebih dari 30 tahun?**

In [41]:
df[df['Umur']>30]

      Nama  Umur  Gender       Pekerjaan    Domisili       Hobi
3   Donald    32    Pria  Data Scientist     Bandung     Gaming
7  Hillary    31  Wanita   ML Researcher  Yogyakarta  Traveling

**9. Siapa sajakah yang berumur kurang dari 30 tahun dan hobinya Gaming?**

In [45]:
df[(df['Umur']<30) & (df['Hobi']=='Gaming')]

    Nama  Umur  Gender     Pekerjaan Domisili    Hobi
0  Adele    24  Wanita  Data Analyst  Jakarta  Gaming

**10. Tampilkan nama orang yang pekerjaannya adalah Data Analyst! Tampilkan kolom nama saja dalam bentuk Series!**

In [48]:
df[df['Pekerjaan'] == 'Data Analyst']['Nama']

0     Adele
4    Eminem
9      Joko
Name: Nama, dtype: object

**11. Apa saja pekerjaan orang-orang yang berdomisili di Jakarta? Tampilkan nama dan pekerjaannya!**

In [51]:
df[df['Domisili']=='Jakarta'][['Nama','Pekerjaan']]

     Nama       Pekerjaan
0   Adele    Data Analyst
2  Camila  Data Scientist
4  Eminem    Data Analyst
8   Indro      BI Analyst

**12. Apa saja hobi para wanita yang ada di dataset? Tampilkan hanya kolom Nama, Hobi, Umur secara berurutan!**

In [53]:
df[df['Gender']=='Wanita'][['Nama', 'Hobi', 'Umur']]

      Nama       Hobi  Umur
0    Adele     Gaming    24
1  Beyonce      Masak    25
2   Camila       Baca    30
6     Gaga     Basket    29
7  Hillary  Traveling    31

**13. Siapa saja yang berumur lebih tua dari Eminem? Tampilkan kolom nama dan umur!**

In [96]:
umurEminem = df[df['Nama']=='Eminem']['Umur']
umurEminem = umurEminem.iloc[0]
umurEminem
df[df['Umur']>umurEminem][['Nama', 'Umur']]

      Nama  Umur
2   Camila    30
3   Donald    32
6     Gaga    29
7  Hillary    31
8    Indro    30
9     Joko    29

**14. Berdasarkan data, apakah ada wanita yang hobinya traveling?**

In [88]:
df[(df['Gender'] == 'Wanita') & (df['Hobi'] == 'Traveling')]

      Nama  Umur  Gender      Pekerjaan    Domisili       Hobi
7  Hillary    31  Wanita  ML Researcher  Yogyakarta  Traveling